Revit 2026 API

# SweptBlendSelectedPath Property

---

The selected curve used for the swept blend path.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Curve SelectedPath { get; }
```
```vb
Public ReadOnly Property SelectedPath As Curve
	Get
```
```cpp
public:
property Curve^ SelectedPath {
	Curve^ get ();
}
```
```fsharp
member SelectedPath : Curve with get
```

#### Property Value

Curve

If the swept blend is based on a sketched path, this property is .

#### Reference

SweptBlend Class

Autodesk.Revit.DB Namespace